# 데이터 합치기와 재구성

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([85, 90, 78, 92, 88, 75],
             index=[['1학년', '1학년', '1학년', '2학년', '2학년', '2학년'],
                    ['a반', 'a반', 'b반', 'a반', 'b반', 'b반']])

In [8]:
s['1학년']

a반    85
a반    90
b반    78
dtype: int64

In [11]:
s.loc[('1학년', 'a반')]

1학년  a반    85
     a반    90
dtype: int64

In [12]:
s.loc[('1학년',['a반', 'b반'])]

1학년  a반    85
     a반    90
     b반    78
dtype: int64

In [13]:
df = pd.DataFrame([[50, 60],[70, 80],[100, 110],[120, 130]],
                 index=[['2020년', '2020년', '2021년', '2021년'],
                        ['구월점', '부평점', '구월점', '부평점']],
                 columns=['제품1', '제품2'])
df

           제품1  제품2
2020년 구월점   50   60
      부평점   70   80
2021년 구월점  100  110
      부평점  120  130

In [23]:
df1 = pd.DataFrame({'학번' : [1, 2, 3], '이름' : ['철수', '영희', '민수']})
df1

   학번  이름
0   1  철수
1   2  영희
2   3  민수

In [24]:
df2 = pd.DataFrame({'학번' : [1, 2, 4], '점수' : [90, 85, 70]})
df2

   학번  점수
0   1  90
1   2  85
2   4  70

In [36]:
df3 = pd.merge(df1, df2, on='학번', how='left')

In [37]:
df3

   학번  이름    점수
0   1  철수  90.0
1   2  영희  85.0
2   3  민수   NaN

In [38]:
df3 = pd.merge(df1, df2, on='학번', how='right')

In [39]:
df3

   학번   이름  점수
0   1   철수  90
1   2   영희  85
2   4  NaN  70

In [40]:
df3 = pd.merge(df1, df2, on='학번', how='outer')

In [41]:
df3

   학번   이름    점수
0   1   철수  90.0
1   2   영희  85.0
2   3   민수   NaN
3   4  NaN  70.0

In [42]:
df1 = pd.DataFrame({'학번' : [1, 2, 3], '이름' : ['철수', '영희', '민수']})
df2 = pd.DataFrame({'학번' : [1, 2, 4], '점수' : [90, 85, 70]})

In [47]:
pd.concat([df1, df2], axis=1)

   학번  이름  학번  점수
0   1  철수   1  90
1   2  영희   2  85
2   3  민수   4  70

In [48]:
pd.concat([df1, df2], ignore_index=True)

   학번   이름    점수
0   1   철수   NaN
1   2   영희   NaN
2   3   민수   NaN
3   1  NaN  90.0
4   2  NaN  85.0
5   4  NaN  70.0

In [49]:
df = pd.DataFrame({'이름' : ['철수', '영희', '철수', '영희'],
                  '과목' : ['국어', '국어', '수학', '수학'],
                  '점수' : [90, 85, 80, 95]})
df

   이름  과목  점수
0  철수  국어  90
1  영희  국어  85
2  철수  수학  80
3  영희  수학  95

In [50]:
df.pivot(index='이름', columns='과목', values='점수')

과목  국어  수학
이름
영희  85  95
철수  90  80